modules/editors/emacs/doom/config.org
** theme
:PROPERTIES:
:ID:       918efa68-0a34-4e90-ba5f-305b628bbb7b
:END:
#+begin_src emacs-lisp :tangle packages.el
(package! info-colors)

#+end_src

#+begin_src emacs-lisp :tangle config.el
;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:

(use-package! doom-themes
  :config
  ;;Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t ; if nil, italics is universally disabled
        doom-themes-padded-modeline t
        doom-themes-treemacs-enable-variable-pitch nil)
  ;;(doom-themes-treemacs-config)
  (doom-themes-org-config))


;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;; (setq doom-theme 'doom-one)
;; (setq doom-theme 'doom-dracula)
;; (setq doom-theme 'doom-solarized-light)
(setq doom-themes-dark '(doom-dracula doom-vibrant doom-city-lights doom-moonlight doom-horizon
                         doom-one doom-solarized-dark doom-palenight doom-spacegrey
                         doom-old-hope doom-oceanic-next doom-monokai-pro doom-material doom-henna
                         doom-ephemeral chocolate doom-zenburn doom-peacock doom-1337))

(setq doom-themes-light '(doom-one-light doom-solarized-light  doom-opera-light))

(defun random-choice (items)
  "Random choice a list"
  (let* ((size (length items))
         (index (random size)))
    (nth index items)))

(defun my/apply-theme (appearance)
  "Load theme, taking current system APPEARANCE into consideration."
  (mapc #'disable-theme custom-enabled-themes)
  (pcase appearance
    ('light (load-theme (random-choice doom-themes-light) t))
    ('dark  (load-theme (random-choice doom-themes-dark) t))
))



(after! doom-themes
  (if IS-MAC (add-hook 'ns-system-appearance-change-functions #'my/apply-theme)
  (setq doom-theme 'doom-nano-light)))




;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.

(setq display-line-numbers-type 'relative)

(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")

(use-package! info-colors
  :defer t
  :commands (info-colors-fontify-node))

(add-hook! 'Info-selection-hook 'info-colors-fontify-node)
#+end_src
** dashboard
:PROPERTIES:
:ID:       24df29ee-b60d-4408-ac20-1c7c95da1918
:END:
#+begin_src emacs-lisp :tangle config.el
;; this code from https://randomgeekery.org/config/emacs/doom/

#+end_src
** global mode
:PROPERTIES:
:ID:       cd7500b9-220e-4c2d-9946-5f86248c1a7e
:END:
#+begin_src emacs-lisp :tangle config.el
(setq menu-bar-mode t)
#+end_src
** alpha
#+begin_src emacs-lisp :tangle packages.el
(package! transwin)
#+end_src
#+begin_src emacs-lisp :tangle config.el
(use-package transwin
  :config
  (setq transwin--current-alpha 80)
  (setq transwin-delta-alpha 5)
  (setq transwin-parameter-alpha 'alpha-background)
)
#+end_src
* Editor
** 分词
#+begin_src emacs-lisp :tangle packages.el
;;(package! jieba :recipe (:host github :repo "cireu/jieba.el"))
;; (if IS-MAC
  ;; (package! emt :recipe (:host github :repo "roife/emt") :pin "7bea66de1b26d3f3f1cf9e940b269809c0c531b9")
;; )
#+end_src

#+begin_src emacs-lisp :tangle config.el
;;(use-package jieba
;;  :commands jieba-mode
;;  :init (jieba-mode))
;; (use-package emt
  ;; :defer t
  ;; :hook (after-init . emt-mode)
  ;; :config
  ;; (setq emt-lib-path (concat doom-emacs-dir "EMT/libEMT.dylib"))
;; )
#+end_src
** Meow
:PROPERTIES:
:ID:       ae971f56-8eff-42eb-a096-8a8a7febe736
:END:

#+begin_src emacs-lisp :tangle no
(package! meow)
#+end_src


#+begin_src emacs-lisp :tangle no
(defconst meow-cheatsheet-layout-engrammer
  '((<TLDE> "[" "{")
    (<AE01> "1" "!")
    (<AE02> "2" "@")
    (<AE03> "3" "#")
    (<AE04> "4" "$")
    (<AE05> "5" "%")
    (<AE06> "6" "^")
    (<AE07> "7" "&")
    (<AE08> "8" "*")
    (<AE09> "9" "()")
    (<AE10> "0" ")")
    (<AE11> "[" "{")
    (<AE12> "]" "}")
    (<AD01> "b" "B")
    (<AD02> "y" "Y")
    (<AD03> "o" "O")
    (<AD04> "u" "U")
    (<AD05> "'" "\"")
    (<AD06> ";" ":")
    (<AD07> "l" "L")
    (<AD08> "d" "D")
    (<AD09> "w" "W")
    (<AD10> "v" "v")
    (<AD11> "z" "Z")
    (<AD12> "+" "=")
    (<BKSL> "\\" "|")
    (<AC01> "c" "C")
    (<AC02> "i" "i")
    (<AC03> "e" "E")
    (<AC04> "a" "A")
    (<AC05> "," "<")
    (<AC06> "." ">")
    (<AC07> "h" "H")
    (<AC08> "t" "T")
    (<AC09> "s" "S")
    (<AC10> "n" "N")
    (<AC11> "q" "Q")
    (<AB01> "g" "G")
    (<AB02> "x" "X")
    (<AB03> "j" "J")
    (<AB04> "k" "K")
    (<AB05> "-" "_")
    (<AB06> "/" "?")
    (<AB07> "r" "R")
    (<AB08> "m" "M")
    (<AB09> "f" "f")
    (<AB10> "p" "P")
    (<LSGT> "-" "_")))

;; Leader Key
(defun meow/setup-leader ()
  (map! :leader
        "?" #'meow-cheatsheet
        "/" #'meow-keypad-describe-key
        "1" #'meow-digit-argument
        "2" #'meow-digit-argument
        "3" #'meow-digit-argument
        "4" #'meow-digit-argument
        "5" #'meow-digit-argument
        "6" #'meow-digit-argument
        "7" #'meow-digit-argument
        "8" #'meow-digit-argument
        "9" #'meow-digit-argument
        "0" #'meow-digit-argument))

;; Keypad
(defun meow/setup-keypad ()
  (map! :map meow-keypad-state-keymap
        "?" #'meow-cheatsheet
        "/" #'meow-keypad-describe-key
        "1" #'meow-digit-argument
        "2" #'meow-digit-argument
        "3" #'meow-digit-argument
        "4" #'meow-digit-argument
        "5" #'meow-digit-argument
        "6" #'meow-digit-argument
        "7" #'meow-digit-argument
        "8" #'meow-digit-argument
        "9" #'meow-digit-argument
        "0" #'meow-digit-argument
        "h" #'help-command))

(defun meow/setup ()
  (map! :map meow-normal-state-keymap
        "0" #'meow-expand-0
        "1" #'meow-expand-1
        "2" #'meow-expand-2
        "3" #'meow-expand-3
        "4" #'meow-expand-4
        "5" #'meow-expand-5
        "6" #'meow-expand-6
        "7" #'meow-expand-7
        "8" #'meow-expand-8
        "9" #'meow-expand-9
        "-" #'negative-argument
        ";" #'meow-reverse
        "," #'meow-inner-of-thing
        "." #'meow-bounds-of-thing
        "'" #'repeat
        "<escape>" #'ignore))
(defun meow/setup-engrammer ()
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-engrammer)
  (meow/setup)
  (meow-motion-overwrite-define-key)
  (map! :map meow-normal-state-keymap
        "0" #'meow-expand-0
        "1" #'meow-expand-1
        "2" #'meow-expand-2
        "3" #'meow-expand-3
        "4" #'meow-expand-4
        "5" #'meow-expand-5
        "6" #'meow-expand-6
        "7" #'meow-expand-7
        "8" #'meow-expand-8
        "9" #'meow-expand-9
        "-" #'negative-argument
        ";" #'meow-reverse
        "," #'meow-inner-of-thing
        "." #'meow-bounds-of-thing
        "[" #'meow-beginning-of-thing
        "]" #'meow-end-of-thing
        "/" #'meow-visit
        "a" #'meow-append
        "A" #'meow-open-below
        "b" #'meow-back-word
        "B" #'meow-back-symbol
        "c" #'meow-change
        "C" #'meow-cancel
        "d" #'meow-prev
        "D" #'meow-prev-expand
        "e" #'meow-n
        "E" #'meow-next-symbol
        "f" #'meow-till
        "F" #'meow-find
        "g" #'meow-cancel-selection
        "G" #'meow-grab
        "h" #'meow-left
        "H" #'meow-left-expand
        "i" #'meow-insert
        "I" #'meow-open-above
        "j" #'meow-join
        "J" #'meow-join-sexp
        "k" #'meow-kill
        "K" #'meow-keypad
        "l" #'meow-line
        "L" #'meow-goto-line
        "m" #'meow-mark-word
        "M" #'meow-mark-symbol
        "n" #'meow-next
        "N" #'meow-next-expand
        "o" #'meow-block
        "O" #'meow-to-block
        "p" #'meow-prev
        "P" #'meow-prev-expand
        "q" #'meow-quit
        "r" #'meow-replace
        "r" #'meow-swap-grab
        "s" #'meow-right
        "S" #'meow-right-expand
        "t" #'meow-next
        "T" #'meow-next-expand
        "u" #'meow-undo
        "U" #'meow-undo-in-selection
        "v" #'meow-visit
        "w" #'meow-next-word
        "W" #'meow-next-symbol
        "x" #'meow-M-x

        ;;'("X" . meow-backward-delete)
        "y" #'meow-yank
        "Y" #'meow-sync-grab
        "z" #'meow-pop-selection
        "'" #'repeat
        "\\" #'qutoed-insert
        "<escape>" #'ignore)
  )


(use-package! meow
  :demand t
  :config
  (require 'meow)
  (meow-global-mode)
  (meow/setup-engrammer)
  (setq meow-use-clipboard t)
  (map! :map meow-normal-state-keymap
        doom-leader-key doom-leader-map)
  (map! :map meow-motion-state-keymap
        doom-leader-key doom-leader-map)
  (map! :map meow-beacon-state-keymap
        doom-leader-key nil)
  (meow/setup-leader)
  (meow/setup-keypad)
  (map! :map meow-keymap [remap describe-key] #'helpful-key)
)
#+end_src

** save
:PROPERTIES:
:ID:       0e0c8caf-e9a6-43b4-b393-e502b9ef7511
:END:
#+begin_src emacs-lisp :tangle config.el
(setq auto-save-default t)
#+end_src
** Directory/File

#+begin_src emacs-lisp :tangle packages.el
(package! dired-preview)
#+end_src


#+begin_src emacs-lisp :tangle config.el

(use-package! dired-preview
  :defer t
  :config
  ;; Default values for demo purposes
  (setq dired-preview-delay 0.7)
  (setq dired-preview-max-size (expt 2 20))
  (setq dired-preview-ignored-extensions-regexp
        (concat "\\."
                "\\(mkv\\|webm\\|mp4\\|mp3\\|ogg\\|m4a"
                "\\|gz\\|zst\\|tar\\|xz\\|rar\\|zip"
                "\\|iso\\|epub\\|pdf\\)"))

  ;; Enable `dired-preview-mode' in a given Dired buffer or do it
  ;; globally:
  (dired-preview-global-mode 1))
#+end_src
** 自动在中英文间添加空格
#+begin_src emacs-lisp :tangle packages.el
(package! pangu-spacing)
#+end_src

#+begin_src emacs-lisp :tangle yes
(use-package! pangu-spacing
  :defer t
  :config

  (setq pangu-spacing-real-insert-separtor t)
)
#+end_src
* Biblio
** init biblio
:PROPERTIES:
:ID:       6d187859-ed0e-4994-8651-0744708518c5
:END:
#+begin_src emacs-lisp :tangle config.el

(setq my/bib (concat "~/org/" "academic.bib"))
(setq my/notes (concat "~/org/" "references"))
(setq my/library-files "~/Documents/org-pdfs")
#+end_src
** zotero
:PROPERTIES:
:ID:       7d0676d7-b53d-4d62-9a1b-bbb49f7a06a7
:END:

#+begin_src emacs-lisp :tangle packages.el
;; (package! zotxt)
#+end_src
** ebib
:PROPERTIES:
:ID:       7836596d-a800-473d-9b3f-1479562dcbe4
:END:
#+begin_src emacs-lisp :tangle packages.el
;;(package! ebib)
#+end_src
** org-ref
:PROPERTIES:
:ID:       169a5d75-2f84-407b-a18e-844701c58ddc
:END:
#+begin_src emacs-lisp :tangle packages.el
(package! org-ref)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! org-ref
  :defer t)
#+end_src

