modules/editors/emacs/doom/config.el

(use-package! info-colors
  :hook (Info-selection-hook . info-colors-fontify-node)
  )

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:

(use-package! doom-themes
  :config
  ;;Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t ; if nil, italics is universally disabled
        doom-themes-padded-modeline t
        doom-themes-treemacs-enable-variable-pitch nil)
  ;;(doom-themes-treemacs-config)
  (doom-themes-org-config))


;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;; (setq doom-theme 'doom-one)
;; (setq doom-theme 'doom-dracula)
;; (setq doom-theme 'doom-solarized-light)
(setq doom-themes-dark '(doom-dracula doom-vibrant doom-city-lights doom-moonlight doom-horizon
                         doom-one doom-solarized-dark doom-palenight doom-spacegrey
                         doom-old-hope doom-oceanic-next doom-monokai-pro doom-material doom-henna
                         doom-ephemeral chocolate doom-zenburn doom-peacock doom-1337))

(setq doom-themes-light '(doom-one-light doom-solarized-light  doom-opera-light))

(defun random-choice (items)
  "Random choice a list"
  (let* ((size (length items))
         (index (random size)))
    (nth index items)))

(defun my/apply-theme (appearance)
  "Load theme, taking current system APPEARANCE into consideration."
  (mapc #'disable-theme custom-enabled-themes)
  (pcase appearance
    ('light (load-theme (random-choice doom-themes-light) t))
    ('dark  (load-theme (random-choice doom-themes-dark) t))
    ))



(after! doom-themes
  (if IS-MAC (add-hook 'ns-system-appearance-change-functions #'my/apply-theme)
    (setq doom-theme 'doom-nano-light)))

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.

(setq display-line-numbers-type 'relative)

;; this code from https://randomgeekery.org/config/emacs/doom/

(setq menu-bar-mode t)

(use-package transwin
  :config
  (setq transwin--current-alpha 80)
  (setq transwin-delta-alpha 5)
  (setq transwin-parameter-alpha 'alpha-background)
)

(if IS-MAC
  (use-package emt
    :defer t
    :hook (after-init . emt-mode)
    :config
    (setq emacs-macos-tokenizer-lib-path (concat user-emacs-directory "EMT/libEMT.dylib"))
  )
)

(setq auto-save-default t)

(use-package! dired-preview
  :defer t
  :config
  ;; Default values for demo purposes
  (setq dired-preview-delay 0.7)
  (setq dired-preview-max-size (expt 2 20))
  (setq dired-preview-ignored-extensions-regexp
        (concat "\\."
                "\\(mkv\\|webm\\|mp4\\|mp3\\|ogg\\|m4a"
                "\\|gz\\|zst\\|tar\\|xz\\|rar\\|zip"
                "\\|iso\\|epub\\|pdf\\)"))

  ;; Enable `dired-preview-mode' in a given Dired buffer or do it
  ;; globally:
  (dired-preview-global-mode 1))

(use-package! pangu-spacing
  :defer t
  :config
  (setq pangu-spacing-real-insert-separtor t)
)

(setq my/bib (concat "~/org/" "academic.bib"))
(setq my/notes (concat "~/org/" "references"))
(setq my/library-files "~/Documents/org-pdfs")

(use-package! citar
  :defer t
  :config
