modules/editors/emacs/doom/packages.el



(package! info-colors)

(package! transwin)

;;(if IS-MAC
;;    (package! emt :recipe (:host github :repo "roife/emt") :pin ;; "7bea66de1b26d3f3f1cf9e940b269809c0c531b9")
;;)

(package! dired-preview)

(package! pangu-spacing)
