modules/editors/emacs/doom/packages.el

;; interact with org-roam and bibtex
(package! org-roam-bibtex)
