modules/editors/emacs/doom/config.org
** org 美化
:PROPERTIES:
:ID:       85728e6b-30dd-4781-b1f2-a0e7462f6f45
:END:
#+begin_src emacs-lisp conf :tangle packages.el
(package! org-modern)
(package! org-appear)
;;(package! valign :recipe (:host github :repo "casouri/valign"))
;;(package! org-superstar)

;;(package! org-visual-outline)
#+end_src


#+begin_src emacs-lisp conf :tangle config.el
;;(use-package! org-visual-outline
;;  :after org
;;  :hook
;;  (org-mode . org-dynamic-bullets-mode)
;;  (org-mode . org-visual-indent-mode)
;;
;;  )


(use-package! visual-fill-column
  :after org
  :defer t
  :custom
  (visual-fill-column-width 80))

(use-package! org-modern
  :after org
  :defer t
  :hook (org-mode . org-modern-mode)
        (org-agenda-finalize . org-modern-agenda)
)

(use-package! org-appear
  :hook (org-mode . org-appear-mode)
  :defer t
  :config
  (setq org-appear-autoemphasis t
        org-appear-autolinks t
        org-appear-autosubmarkers t
        org-appear-autoentities t
        org-appear-autokeywords t
        org-appear-inside-latex t
        )
)

;;(use-package! valign
;;  :hook
;;  (org-mode . valign-mode)
;;  (markdown-mode . valign-mode)
;;  :config
;;  (setq valign-fancy-bar 1)
;;)

#+end_src

** org-download :ATTACH:
:PROPERTIES:
:ID:       1e1e87f9-323b-46b6-87b1-0748b585dac3
:END:
#+begin_src emacs-lisp conf :tangle packages.el
(package! org-download)
#+end_src

#+begin_src emacs-lisp conf :tangle config.el
;; config org download
(use-package! org-download
  ;;:hook ((org-mode dired-mode) . org-download-enable)
  :after org
  :defer t
  :config
  (setq org-download-method 'directory)
  (setq org-download-image-dir "~/Library/Mobile Documents/com~apple~CloudDocs/Documents/org-attach")
  (setq org-download-heading-lvl 'nil)
)
#+end_src



** org babel
** org mind map
:PROPERTIES:
:ID:       72e9d184-30da-46b7-a67a-ce1d3e796b10
:END:
#+begin_src emacs-lisp :tangle packages.el
;;(package! org-mind-map :recipe (:host github :repo "the-ted/org-mind-map"
;;                                :files ("*.el")))
#+end_src

#+begin_src emacs-lisp conf :tangle config.el

;; config org-mode
;;(use-package! org-mind-map
;;  :config
;;  (setq org-mind-map-engine "dot")
;;)
#+end_src
** org-brain
:PROPERTIES:
:ID:       4363bd88-37fd-448e-8b22-6a42e6f7c19e
:END:
#+begin_src emacs-lisp conf :tangle packages.el
;;(package! org-brain)
;;(package! polymode)
#+end_src

#+begin_src emacs-lisp :conf :tangle config.el
;; config org brain
;;(use-package! org-brain
;;  :after org
;;  :hook
;;  (before-save-hook . #'org-brain-ensure-ids-in-buffer)
;;  :init
;;  (setq org-brain-path (concat org-directory "brain"))
;;  ;; For Evil users
;;  (with-eval-after-load 'evil
;;    (evil-set-initial-state 'org-brain-visualize-mode 'emacs))
;;  :config
;;  (setq org-id-track-globally t)
;;  (setq org-id-locations-file (concat org-directory ".orgids"))
;;  (add-hook 'before-save-hook )
;;  (setq org-brain-visualize-default-choices 'all)
;;  (setq org-brain-title-max-length 12)
;;  (setq org-brain-include-file-entries nil
;;        org-brain-file-entries-use-title nil))

;; Allows you to edit entries directly from org-brain-visualize
;;(use-package! polymode
;;  :config
;;  (add-hook 'org-brain-visualize-mode-hook #'org-brain-polymode))
#+end_src

** org-agenda
:PROPERTIES:
:ID:       ee84bfc0-3e42-4a8d-a9c2-2d8c3093d06d
:END:

#+begin_src emacs-lisp conf :tangle config.el
(use-package! org-agenda
  :after org
  :defer t
  :config
  (setq org-agenda-files '("~/org/pages/TODO.org"))
  ;; 时间前导0
  (setq org-agenda-time-leading-zero t)
  ;; 默认显示区间
  (setq org-agenda-span 7)
  ;; agenda view 默认从周一开始显示
  (setq org-agenda-start-on-weekday 1)
   ;; Agenda styling
   (setq org-agenda-tags-column 0
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")
)
#+end_src
** org ppt
:PROPERTIES:
:ID:       06f8936a-d6b2-4e5e-b2e1-a1c8ff3ad6e0
:END:
#+begin_src emacs-lisp conf :tangle config.el
;;(use-package! org-re-reveal
;;  :after org
;;  :config
;;  (setq org-re-reveal-width 1200)
;;  (setq org-re-reveal-height 1000)
;;  (setq org-re-reveal-margin "0.1")
;;  (setq org-re-reveal-min-scale "0.5")
;;  (setq org-re-reveal-max-scale "2.5")
;;  (setq org-re-reveal-transition "cube")
;;  (setq org-re-reveal-control t)
;;  (setq org-re-reveal-center t)
;;  (setq org-re-reveal-progress t)
;;  (setq org-re-reveal-history nil)
;;)
#+end_src
** org mode enhance
:PROPERTIES:
:ID:       10967870-52c8-4195-9b79-a1a929cb7969
:END:
#+begin_src emacs-lisp :conf :tangle config.el
#+end_src
** org capture
:PROPERTIES:
:ID:       990855ee-96c3-46f1-b16c-7105f6094ca0
:END:
#+begin_src emacs-lisp :tangle packages.el
;;(package! doct
;;  :recipe (:host github :repo "progfolio/doct"))
#+end_src

~doct~ (Declarative Org Capture Templates) seems to be a nicer way to set up org-capture.

#+begin_src elisp :tangle config.el
(use-package! org-capture
  :after org
  :defer t
  )
#+end_src
** org hugo
:PROPERTIES:
:ID:       a7fb163c-1d82-4670-ac10-a6180cac2cfb
:END:
#+begin_src elisp :tangle config.el
(use-package! ox-hugo
  :after org-capture ox
  :defer t
  :config
  (setq org-hugo-default-static-subdirectory-for-externals "img")
)
#+end_src

* org-roam
:PROPERTIES:
:ID:       466ca3d1-ca43-4265-9493-1177afe300ce
:END:
** org-roam settings
:PROPERTIES:
:ID: 3f6a8789-2cb1-45ec-ab57-063d22cceaf8
:END:
#+begin_src elisp :tangle packages.el
;;(unpin! org-roam)
(package! org-roam)

;;(unpin! org-roam-ui)
(package! org-roam-ui)

(package! consult-org-roam)
(package! emacsql-sqlite-builtin)

#+end_src
1. 设置org-roam templates 可以与 org-capture 混合使用
2. 自动创建笔记的创建时间和修改时间
3. 跨文件的引用，能够实现笔记的一处修改，处处修改
   - 实现效果不太好


#+begin_src emacs-lisp conf :tangle config.el


(use-package! org-roam
  :after org
  :defer t
  :commands (org-roam-buffer
             org-roam-setup
             org-roam-capture
             org-roam-node-find)
  ;;:bind (("C-c n r a" . org-id-get-create)
  ;;       ("C-c n r l" . org-roam-buffer-toggle)
  ;;       ("C-c n r f" . org-roam-node-find)
  ;;       ("C-c n r g" . org-roam-graph)
  ;;       ("C-c n r i" . org-roam-node-insert)
  ;;       ("C-c n r c" . org-roam-capture)
  ;;       ("C-c n r r" . org-roam-ref-find)
  ;;       ("C-c n r R" . org-roam-ref-add)
  ;;       ("C-c n r s" . org-roam-db-sync)
  ;;       ("C-c n r e" . org-roam-to-hugo-md)
  ;;       ;; Dailies
  ;;       ("C-c n r j" . org-roam-dailies-capture-today))
  :config
  (unless (file-exists-p org-roam-directory) (make-directory org-roam-directory t))
  (unless (file-exists-p org-roam-directory) (make-directory org-roam-dailies-directory t))
  ;; 自动创建org roam 文件夹
  (setq org-id-link-to-org-use-id t)
  (setq org-roam-completion-everywhere t)
  (setq org-roam-capture-templates
        '(("d" "default" plain "%?"
           :target
           (file+head "pages/${slug}.org" "#+title: ${title}\n- tags :: \n")
           :unnarrowed t)))
  (setq org-roam-dailies-capture-templates
        '(
          ("t" "tasks" entry "* TODO %?"
           :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y/%m/%d>\n#+filetags: :journal:\n" ("TODO Tasks :task:")))
          ("n" "notes" entry "* %?"
           :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y/%m/%d>\n#+filetags: :journal:\n" ("Notes :note:")))
          )
        )

  (setq org-roam-mode-sections
        (list #'org-roam-backlinks-section
              #'org-roam-reflinks-section
              #'org-roam-unlinked-references-section)
        )
  )


(use-package! websocket
  :defer t
  :after org-roam)

(use-package! org-roam-ui
  :defer t
  :after org-roam ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  :commands org-roam-ui-open
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start nil))
#+end_src

** org roam timestamps
:PROPERTIES:
:ID:       09752942-9f28-4b04-b64e-867b2186dae1
:END:
自动记录包含 org-id 的节点的修改时间
#+begin_src emacs-lisp conf :tangle packages.el
(package! org-roam-timestamps)
#+end_src

#+begin_src emacs-lisp :tangle config.el
;;自动创建笔记的创建时间和修改时间
(use-package! org-roam-timestamps
  :after org-roam
  :defer t
  :config
  (org-roam-timestamps-mode)
  (setq org-roam-timestamps-parent-file t))

#+end_src
** org transculsion
:PROPERTIES:
:ID:       5586b987-8479-49cf-be97-721142a74ac4
:END:
#+begin_src emacs-lisp :tangle packages.el
(package! org-transclusion)
#+end_src

#+begin_src emacs-lisp :tangle config.el
;;跨文件的引用，能够实现笔记的一处修改，处处修改。
(use-package! org-transclusion
  :after org
  :commands org-transclusion-mode
  :defer t
  :init
  (map!
   :map global-map "<f12>" #'org-transclusion-add
   :leader
   :prefix "n"
   :desc "Org Transclusion Mode" "t" #'org-transclusion-mode))
#+end_src
