modules/editors/emacs/doom/config.el

(use-package! org-modern
  :after org
  :defer t
  :hook (org-mode . org-modern-mode)
        (org-agenda-finalize . org-modern-agenda)
)

(use-package! org-appear
  :hook (org-mode . org-appear-mode)
  :defer t
  :config
  (setq org-appear-autoemphasis t
        org-appear-autolinks t
        org-appear-autosubmarkers t
        org-appear-autoentities t
        org-appear-autokeywords t
        org-appear-inside-latex t
        )
)

;; config org download
(use-package! org-download
  :after org
  :defer t
  :config
  (setq org-download-method 'directory)
  (setq org-download-image-dir "~/Library/Mobile Documents/com~apple~CloudDocs/Documents/org-attach")
  (setq org-download-heading-lvl 'nil)
)

(use-package! org-agenda
  :after org
  :defer t
  :config
  (setq org-agenda-files '("~/org/pages/TODO.org"))
  ;; 时间前导0
  (setq org-agenda-time-leading-zero t)
  ;; 默认显示区间
  (setq org-agenda-span 7)
  ;; agenda view 默认从周一开始显示
  (setq org-agenda-start-on-weekday 1)
   ;; Agenda styling
   (setq org-agenda-tags-column 0
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")
)

(use-package! ox-hugo
  :after org-capture ox
  :defer t
  :config
  (setq org-hugo-default-static-subdirectory-for-externals "img")
)

(use-package! org-roam
  :after org
  :defer t
  :commands (org-roam-buffer
             org-roam-setup
             org-roam-capture
             org-roam-node-find)
  ;;:bind (("C-c n r a" . org-id-get-create)
  ;;       ("C-c n r l" . org-roam-buffer-toggle)
  ;;       ("C-c n r f" . org-roam-node-find)
  ;;       ("C-c n r g" . org-roam-graph)
  ;;       ("C-c n r i" . org-roam-node-insert)
  ;;       ("C-c n r c" . org-roam-capture)
  ;;       ("C-c n r r" . org-roam-ref-find)
  ;;       ("C-c n r R" . org-roam-ref-add)
  ;;       ("C-c n r s" . org-roam-db-sync)
  ;;       ("C-c n r e" . org-roam-to-hugo-md)
  ;;       ;; Dailies
  ;;       ("C-c n r j" . org-roam-dailies-capture-today))
  :config
  (unless (file-exists-p org-roam-directory) (make-directory org-roam-directory t))
  (unless (file-exists-p org-roam-directory) (make-directory org-roam-dailies-directory t))
  ;; 自动创建org roam 文件夹
  (setq org-id-link-to-org-use-id t)
  (setq org-roam-completion-everywhere t)
  (setq org-roam-capture-templates
        '(("d" "default" plain "%?"
           :target
           (file+head "pages/${slug}.org" "#+title: ${title}\n- tags :: \n")
           :unnarrowed t)))
  (setq org-roam-dailies-capture-templates
        '(
          ("t" "tasks" entry "* TODO %?"
           :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y/%m/%d>\n#+filetags: :journal:\n" ("TODO Tasks :task:")))
          ("n" "notes" entry "* %?"
           :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y/%m/%d>\n#+filetags: :journal:\n" ("Notes :note:")))
          )
        )

  (setq org-roam-mode-sections
        (list #'org-roam-backlinks-section
              #'org-roam-reflinks-section
              #'org-roam-unlinked-references-section)
        )
  )


(use-package! websocket
  :defer t
  :after org-roam)

(use-package! org-roam-ui
  :defer t
  :after org-roam ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  :commands org-roam-ui-open
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start nil))

;;自动创建笔记的创建时间和修改时间
(use-package! org-roam-timestamps
  :after org-roam
  :defer t
  :config
  (org-roam-timestamps-mode)
  (setq org-roam-timestamps-parent-file t))

;;跨文件的引用，能够实现笔记的一处修改，处处修改。
(use-package! org-transclusion
  :after org
  :commands org-transclusion-mode
  :defer t
  :init
  (map!
   :map global-map "<f12>" #'org-transclusion-add
   :leader
   :prefix "n"
   :desc "Org Transclusion Mode" "t" #'org-transclusion-mode))
