modules/editors/emacs/doom/packages.el

(package! org-modern)
(package! org-appear)

;;(package! doct
;;  :recipe (:host github :repo "progfolio/doct"))

;;(unpin! org-roam)
(package! org-roam)

;;(unpin! org-roam-ui)
(package! org-roam-ui)

(package! consult-org-roam)
(package! emacsql-sqlite-builtin)

(package! org-roam-timestamps)

(package! org-transclusion)

(package! vulpea)
(package! consult-org-roam)
;;TODO
