modules/editors/emacs/doom/packages.el
;;(package! nursery
;;     :recipe (:host github :repo "chrisbarrett/nursery"))

;;(package! sis)
