modules/editors/emacs/doom/config.el
;;  ;; enable the /context/ and /inline region/ mode for specific buffers
;;  ;; (((text-mode prog-mode) . sis-context-mode)
;;  ;;  ((text-mode prog-mode) . sis-inline-mode))
;;  :after meow
;;  :config
;;  ;; For MacOS
;;  (sis-ism-lazyman-config
;;   ;; English input source may be: "ABC", "US" or another one.
;;   ;; "com.apple.keylayout.ABC"
;;   "com.apple.keylayout.ABC"
;;   ;; Other language input source: "rime", "sogou" or another one.
;;   ;; "im.rime.inputmethod.Squirrel.Rime"
;;   "im.rime.inputmethod.Squirrel.Hans")
;;  (add-hook 'meow-insert-exit-hook #'sis-set-english)
;;  (add-hook 'meow-insert-enter-hook #'sis-set-english)
;;  (add-to-list 'sis-context-hooks 'meow-insert-exit-hook)
;;  (add-to-list 'sis-context-hooks 'meow-insert-enter-hook)
;;  (add-to-list 'sis-respect-minibuffer-triggers (cons 'org-roam-node-find (lambda () 'other)))
;;  (add-to-list 'sis-respect-minibuffer-triggers (cons 'org-roam-node-insert (lambda () 'other)))
;;)

;;(use-package! rime
;;  :defer t
;;  :bind
;;  (:map rime-mode-map
;;        ("S- " . 'rime-send-keybinding))
;;  :config
;;  (setq rime-show-candidate 'posframe)
;;  (setq rime-show-preedit 'inline)
;;  (setq default-input-method "rime")
;;  (setq rime-inline-ascii-trigger 'shift-r)
;;  (setq rime-translate-keybindings '("C-f" "C-b" "C-n" "C-p" "C-g" "<left>" "<right>" "<up>" "<down>" "<prior>" "<next>" "<delete>"))
;;)

;; (use-package rime-regexp
;;   :defer t
;;   :config
;;   (rime-regexp-mode t))

;; Configure Tempel
;;(use-package! tempel
;;  ;; Require trigger prefix before template name when completing.
;;  ;; :custom
;;  ;; (tempel-trigger-prefix "<")
;;
;;  :bind (("M-+" . tempel-complete) ;; Alternative tempel-expand
;;         ("M-*" . tempel-insert))
;;  :after corfu
;;  :init
;;
;;  ;; Setup completion at point
;;  (defun tempel-setup-capf ()
;;    ;; Add the Tempel Capf to `completion-at-point-functions'.
;;    ;; `tempel-expand' only triggers on exact matches. Alternatively use
;;    ;; `tempel-complete' if you want to see all matches, but then you
;;    ;; should also configure `tempel-trigger-prefix', such that Tempel
;;    ;; does not trigger too often when you don't expect it. NOTE: We add
;;    ;; `tempel-expand' *before* the main programming mode Capf, such
;;    ;; that it will be tried first.
;;    (setq-local completion-at-point-functions
;;                (cons #'tempel-expand
;;                      completion-at-point-functions)))
;;
;;  (add-hook 'prog-mode-hook 'tempel-setup-capf)
;;  (add-hook 'text-mode-hook 'tempel-setup-capf)
;;
;;  ;; Optionally make the Tempel templates available to Abbrev,
;;  ;; either locally or globally. `expand-abbrev' is bound to C-x '.
;;  ;; (add-hook 'prog-mode-hook #'tempel-abbrev-mode)
;;  ;; (global-tempel-abbrev-mode)
;;)
;;
;;;; Optional: Add tempel-collection.
;;;; The package is young and doesn't have comprehensive coverage.
;;(use-package! tempel-collection
;;   :after tempel)

;; accept completion from copilot and fallback to company
;; (use-package! copilot
;;   :defer t
;;  :hook (prog-mode . copilot-mode)
;;  :bind (:map copilot-completion-map
;;              ("<tab>" . 'copilot-accept-completion)
;;              ("TAB" . 'copilot-accept-completion)
;;              ("C-TAB" . 'copilot-accept-completion-by-word)
;;              ("C-<tab>" . 'copilot-accept-completion-by-word)))

;; we recommend using use-package to organize your init.el
;;(use-package! ;; codeium
    ;; ;; if you use straight
    ;; ;; :straight '(:type git :host github :repo "Exafunction/codeium.el")
    ;; ;; otherwise, make sure that the codeium.el file is on load-path

    ;; :init
    ;; ;; use globally
    ;; (add-to-list 'completion-at-point-functions #'codeium-completion-at-point)
    ;; ;; or on a hook
    ;; ;; (add-hook 'python-mode-hook
    ;; ;;     (lambda ()
    ;; ;;         (setq-local completion-at-point-functions '(codeium-completion-at-point))))

    ;; ;; if you want multiple completion backends, use cape (https://github.com/minad/cape):
    ;; ;; (add-hook 'python-mode-hook
    ;; ;;     (lambda ()
    ;; ;;         (setq-local completion-at-point-functions
    ;; ;;             (list (cape-super-capf #'codeium-completion-at-point #'lsp-completion-at-point)))))
    ;; ;; an async company-backend is coming soon!

    ;; ;; codeium-completion-at-point is autoloaded, but you can
    ;; ;; optionally set a timer, which might speed up things as the
    ;; ;; codeium local language server takes ~0.2s to start up
    ;; ;; (add-hook 'emacs-startup-hook
    ;; ;;  (lambda () (run-with-timer 0.1 nil #'codeium-init)))

    ;; :defer t
    ;; :config
    ;; (setq use-dialog-box nil) ;; do not use popup boxes

    ;; ;; if you don't want to use customize to save the api-key
    ;; ;; (setq codeium/metadata/api_key "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx")

    ;; ;; get codeium status in the modeline
    ;; (setq codeium-mode-line-enable
    ;;     (lambda (api) (not (memq api '(CancelRequest Heartbeat AcceptCompletion)))))
    ;; (add-to-list 'mode-line-format '(:eval (car-safe codeium-mode-line)) t)
    ;; ;; alternatively for a more extensive mode-line
    ;; ;; (add-to-list 'mode-line-format '(-50 "" codeium-mode-line) t)

    ;; ;; use M-x codeium-diagnose to see apis/fields that would be sent to the local language server
    ;; (setq codeium-api-enabled
    ;;     (lambda (api)
    ;;         (memq api '(GetCompletions Heartbeat CancelRequest GetAuthToken RegisterUser auth-redirect AcceptCompletion))))
    ;; ;; you can also set a config for a single buffer like this:
    ;; ;; (add-hook 'python-mode-hook
    ;; ;;     (lambda ()
    ;; ;;         (setq-local codeium/editor_options/tab_size 4)))

    ;; ;; You can overwrite all the codeium configs!
    ;; ;; for example, we recommend limiting the string sent to codeium for better performance
    ;; (defun my-codeium/document/text ()
    ;;     (buffer-substring-no-properties (max (- (point) 3000) (point-min)) (min (+ (point) 1000) (point-max))))
    ;; ;; if you change the text, you should also change the cursor_offset
    ;; ;; warning: this is measured by UTF-8 encoded bytes
    ;; (defun my-codeium/document/cursor_offset ()
    ;;     (codeium-utf8-byte-length
    ;;         (buffer-substring-no-properties (max (- (point) 3000) (point-min)) (point))))
    ;; (setq codeium/document/text 'my-codeium/document/text)
    ;; (setq codeium/document/c
    ;;      ursor_offset 'my-codeium/document/cursor_offset))

;;(use-package! ts-docstr
;;:config
;;(setq ts-docstr-key-support t)
;;(setq ts-docstr-ask-on-enable t))

(after! lsp-mode
  (setq lsp-ui-doc-show-with-cursor t)
)

(if IS-MAC
