modules/editors/emacs/doom/config.org
*** conda and micromamba opt
:PROPERTIES:
:ID:       d4be558f-c96d-4107-a442-14fe7648ce6b
:END:
#+begin_src emacs-lisp :tangle packages.el
(if IS-MAC (package! micromamba))
#+end_src

#+begin_src emacs-lisp conf :tangle config.el
(if IS-MAC
  (use-package! micromamba)
)
#+end_src
*
** Latex mode
*** Latex Preview
**** xenops
async latex view
***** Package
:PROPERTIES:
:ID:       815a26d8-1c63-4443-909d-bb9de95bba7d
:END:
#+begin_src emacs-lisp conf :tangle packages.el
;;(when (executable-find "xelatex")
;;  (package! xenops)
;;)
#+end_src

***** config
:PROPERTIES:
:ID:       adc082be-eeac-46ea-b23a-05294f26cb58
:END:
#+begin_src emacs-lisp conf :tangle config.el
;;(use-package! xenops
;;    :after org
;;    :hook
;;    (org-mode . xenops-mode)
;;    (latex-mode . xenops-mode)
;;    (LaTex-mode . xenops-mode)
;;    :config
;;    (setq xenops-reveal-on-entry t
;;          ;;xenops-image-directory (expand-file-name "xenops/image" doom-cache-dir)
;;          xenops-math-latex-process 'xelatex)
;;)


;;(after! xenops
;;  (defun xenops-math-block-delimiter-lines-regexp ()
;;    "A regexp matching the start or end line of any block math element."
;;    (format "\\(%s\\)"
;;            (s-join "\\|"
;;                    (apply #'append (xenops-elements-get-for-types '(block-math table algorithm) :delimiters)))))
;;  (defun xenops-math-parse-element-at-point ()
;;    "Parse any math element at point."
;;    (or (xenops-math-parse-inline-element-at-point)
;;        (xenops-math-parse-block-element-at-point)
;;        (xenops-math-parse-table-at-point)
;;        (xenops-math-parse-algorithm-at-point)))
;;
;;  (defun xenops-math-parse-algorithm-at-point ()
;;    "Parse algorithm element at point."
;;    (xenops-parse-element-at-point 'algorithm))
;;
;;
;;  (add-to-list 'xenops-elements '(algorithm
;;                                  (:delimiters
;;                                   ("^[ 	]*\\\\begin{algorithm}"
;;                                    "^[ 	]*\\\\end{algorithm}"))
;;                                  (:parser . xenops-math-parse-algorithm-at-point)
;;                                  (:handlers . block-math)))
;;  )
#+end_src
**** fontify
#+begin_src emacs-lisp :tangle config.el
(setq font-latex-match-reference-keywords
       '(;; BibLaTeX.
        ("printbibliography" "[{")
        ("addbibresource" "[{")
        ;; Standard commands.
        ("cite" "[{")
        ("citep" "[{")
        ("citet" "[{")
        ("Cite" "[{")
        ("parencite" "[{")
        ("Parencite" "[{")
        ("footcite" "[{")
        ("footcitetext" "[{")
        ;; Style-specific commands.
        ("textcite" "[{")
        ("Textcite" "[{")
        ("smartcite" "[{")
        ("Smartcite" "[{")
        ("cite*" "[{")
        ("parencite*" "[{")
        ("supercite" "[{")
        ;; Qualified citation lists.
        ("cites" "[{")
        ("Cites" "[{")
        ("parencites" "[{")
        ("Parencites" "[{")
        ("footcites" "[{")
        ("footcitetexts" "[{")
        ("smartcites" "[{")
        ("Smartcites" "[{")
        ("textcites" "[{")
        ("Textcites" "[{")
        ("supercites" "[{")
        ;; Style-independent commands.
        ("autocite" "[{")
        ("Autocite" "[{")
        ("autocite*" "[{")
        ("Autocite*" "[{")
        ("autocites" "[{")
        ("Autocites" "[{")
        ;; Text commands.
        ("citeauthor" "[{")
        ("Citeauthor" "[{")
        ("citetitle" "[{")
        ("citetitle*" "[{")
        ("citeyear" "[{")
        ("citedate" "[{")
        ("citeurl" "[{")
        ;; Special commands.
        ("fullcite" "[{")
        ;; Cleveref.
        ("cref" "{")
        ("Cref" "{")
        ("cpageref" "{")
        ("Cpageref" "{")
        ("cpagerefrange" "{")
        ("Cpagerefrange" "{")
        ("crefrange" "{")
        ("Crefrange" "{")
        ("labelcref" "{")
        ;; hyperref
        ("autoref" "{")
        ("Autoref" "{")))

#+end_src
**** org-xlatex
***** package
:PROPERTIES:
:ID:       beb542d5-9260-4973-b108-c18423e1976d
:END:
#+begin_src emacs-lisp conf :tangle packages.el
;;(package! org-xlatex :recipe (:host github :repo "ksqsf/org-xlatex"))
#+end_src
***** config
:PROPERTIES:
:ID:       a72eacbd-b4dc-4afd-8265-3c2b47091a6b
:END:
#+begin_src emacs-lisp conf :tangle config.el
;;(use-package org-xlatex
;;  :after org
  ;;:hook (org-mode . org-xlatex-mode)
;;)
#+end_src
** 大纲
#+begin_src emacs-lisp :tangle config.el
;; 为 latex 提供折叠大纲功能
(use-package outline
  :hook
  (LaTeX-mode . outline-minor-mode)
)
#+end_src
** Doc
:PROPERTIES:
:ID:       e9453c1b-4a72-4978-8a8c-a3345b999566
:END:
use dash open app dash
#+begin_src emacs-lisp :tangle packages.el
(if IS-MAC (package! dash-at-point))
#+end_src

#+begin_src emacs-lisp conf :tangle config.el
(if IS-MAC
(use-package! dash-at-point
  :defer t
  :config
 (add-to-list 'dash-at-point-mode-alist '(python-mode . "python3,django,twisted,sphinx,flask,tornado,sqlalchemy,numpy,scipy,saltcvp,torch,torchvision"))
))
#+END_SRC
** Copilot
:PROPERTIES:
:ID:       54b794a2-a5f3-4ac9-a8ce-5526c340ea3d
:END:
#+begin_src emacs-lisp :tangle packages.el
;;(package! copilot
;;  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
#+end_src

#+begin_src emacs-lisp :tangle config.el
;; accept completion from copilot and fallback to company
;;(use-package! copilot
;;  :hook (prog-mode . copilot-mode)
;;  :bind (:map copilot-completion-map
;;              ("<tab>" . 'copilot-accept-completion)
;;              ("TAB" . 'copilot-accept-completion)
;;              ("C-TAB" . 'copilot-accept-completion-by-word)
;;              ("C-<tab>" . 'copilot-accept-completion-by-word)))
#+end_src
** just
#+begin_src emacs-lisp :tangle packages.el
(package! just-mode)
(package! justl)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! just-mode
  :defer t)

(use-package! justl
  :defer t
  :config
  (map! :n "e" 'justl-exec-recipe))
#+end_src

** Graphviz
#+begin_src emacs-lisp :tangle packages.el
(package! graphviz-dot-mode)
(package! ob-blockdiag)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! graphviz-dot-mode
  :mode "\\.\\(diag\\|dot\\|nwdiag\\|rackdiag\\)\\'"
  :init
  (after! org
    (add-to-list 'org-src-lang-modes
                  '("dot" . graphviz-dot)))
  :config
  (cl-defun +format-graphviz (&key buffer scratch callback &allow-other-keys)
    "Format graphviz graphs."
    (with-current-buffer scratch
      (let ((inhibit-message t)
            (message-log-max nil))
        (goto-char (point-min))
        (graphviz-dot-indent-graph))
      (funcall callback)))

  (when (and (not (treesit-available-p))
              (modulep! :lang graphviz +tree-sitter))
    (add-hook 'graphviz-dot-mode-hook #'tree-sitter! 'append))
  (after! tree-sitter
    (set-tree-sitter-lang! 'graphviz-dot-mode 'dot))
  (when (modulep! :completion company)
    (set-company-backend! 'graphviz-dot-mode 'company-graphviz-dot-backend))
  (setq graphviz-dot-view-command "kde-open5 %s") ;; doesn't work, need a proper viewer

  (enable-auto-formatter! 'graphviz-dot-mode)
  (set-formatter! 'graphviz-dot-mode #'+format-graphviz :modes '(graphviz-dot-mode))

  (map! :map graphviz-dot-mode-map
        :localleader
        :desc "External view" :nv "e" #'graphviz-dot-view
        :desc "Preview"       :nv "p" #'graphviz-dot-preview
        :prefix ("t" . "toggle")
        :desc "Preview"       :nv "p" (cmd! (if graphviz-dot-auto-preview-on-save
                                                (graphviz-turn-off-live-preview)
                                              (graphviz-turn-on-live-preview)))))
#+end_src
* reader
** pdf tools
:PROPERTIES:
:ID:       0e9cc110-63ef-4e95-a389-173f48b658df
:END:
#+begin_src emacs-lisp :tangle packages.el
;;(unpin! pdf-tools)
#+end_src
** org noter and nov
:PROPERTIES:
:ID:       e8eadfe1-c054-4638-9a34-1da12bbe3ae3
:END:
#+begin_src emacs-lisp :tangle packages.el
;;(package! org-noter :recipe (:host github :repo "org-noter/org-noter"))

;;(package! org-noter-plus :recipe (:host github :repo "yuchen-lea/org-noter-plus"))
#+end_src


#+begin_src emacs-lisp :tangle config.el
(use-package pdf-tools
  :defer t
  :after org)

(use-package pdf-view
  :defer t
  :after (:all org pdf-tools))

(use-package! org-noter
  :after org
  :defer t
  :config
  (setq org-noter-notes-search-path (concat org-directory "references"))
  (setq org-noter-alway-create-frame t)
  (setq org-noter-auto-save-last-location t)
  (setq org-noter-doc-split-fraction '(0.52 0.48))
)


(after! org-noter
  (defun eli/org-noter-set-highlight (&rest _arg)
    "Highlight current org-noter note."
    (save-excursion
      (with-current-buffer (org-noter--session-notes-buffer org-noter--session)
        (remove-overlays (point-min) (point-max) 'org-noter-current-hl t)
        (goto-char (org-entry-beginning-position))
        (let* ((hl (org-element-context))
               (hl-begin (plist-get  (plist-get hl 'headline) :begin))
               (hl-end (1- (plist-get  (plist-get hl 'headline) :contents-begin)))
               (hl-ov (make-overlay hl-begin hl-end)))
          (overlay-put hl-ov 'face 'mindre-keyword)
          (overlay-put hl-ov 'org-noter-current-hl t))
        (org-cycle-hide-drawers 'all))))
  (advice-add #'org-noter--focus-notes-region
              :after #'eli/org-noter-set-highlight)
  (advice-add #'org-noter-insert-note
              :after #'eli/org-noter-set-highlight)
)

;;(use-package! org-noter-nov-overlay)

;;(use-package! org-noter-plus
;;  :commands (org-noter-plus--follow-nov-link)
;;  :config
;;  (setq org-noter-plus-image-dir "~/org/.attach/") ;; Directory to store images extracted from pdf files
;;)
;;
;;(after! nov
;;  (org-link-set-parameters "nov"
;;                           ;; Replace the default nov link to work better with org-noter
;;                           :follow 'org-noter-plus--follow-nov-link)
;;  )
#+end_src
** org media note
:PROPERTIES:
:ID:       db750490-5187-4e2f-bb38-b1ac885298b7
:END:
#+begin_src emacs-lisp :tangle packages.el
;;(package! pretty-hydra)  ;; dependency
;;(package! org-media-note :recipe (:host github :repo "yuchen-lea/org-media-note"))
#+end_src


#+begin_src emacs-lisp :tangle config.el
;;(use-package! org-media-note
;;  :init (setq org-media-note-use-org-ref t)
;;  :hook (org-mode .  org-media-note-mode)
;;  :after org
;;  :bind (("H-v" . org-media-note-hydra/body))  ;; Main entrance
;;  :config
;;  (setq org-media-note-screenshot-image-dir "~/org/.attach/")  ;; Folder to save screenshot
;;  (setq org-media-note-use-refcite-first t)  ;; use videocite link instead of video link if possible
;;  )
#+end_src
