modules/editors/emacs/doom/config.el
  (use-package! micromamba)
)

(setq font-latex-match-reference-keywords
       '(;; BibLaTeX.
        ("printbibliography" "[{")
        ("addbibresource" "[{")
        ;; Standard commands.
        ("cite" "[{")
        ("citep" "[{")
        ("citet" "[{")
        ("Cite" "[{")
        ("parencite" "[{")
        ("Parencite" "[{")
        ("footcite" "[{")
        ("footcitetext" "[{")
        ;; Style-specific commands.
        ("textcite" "[{")
        ("Textcite" "[{")
        ("smartcite" "[{")
        ("Smartcite" "[{")
        ("cite*" "[{")
        ("parencite*" "[{")
        ("supercite" "[{")
        ;; Qualified citation lists.
        ("cites" "[{")
        ("Cites" "[{")
        ("parencites" "[{")
        ("Parencites" "[{")
        ("footcites" "[{")
        ("footcitetexts" "[{")
        ("smartcites" "[{")
        ("Smartcites" "[{")
        ("textcites" "[{")
        ("Textcites" "[{")
        ("supercites" "[{")
        ;; Style-independent commands.
        ("autocite" "[{")
        ("Autocite" "[{")
        ("autocite*" "[{")
        ("Autocite*" "[{")
        ("autocites" "[{")
        ("Autocites" "[{")
        ;; Text commands.
        ("citeauthor" "[{")
        ("Citeauthor" "[{")
        ("citetitle" "[{")
        ("citetitle*" "[{")
        ("citeyear" "[{")
        ("citedate" "[{")
        ("citeurl" "[{")
        ;; Special commands.
        ("fullcite" "[{")
        ;; Cleveref.
        ("cref" "{")
        ("Cref" "{")
        ("cpageref" "{")
        ("Cpageref" "{")
        ("cpagerefrange" "{")
        ("Cpagerefrange" "{")
        ("crefrange" "{")
        ("Crefrange" "{")
        ("labelcref" "{")
        ;; hyperref
        ("autoref" "{")
        ("Autoref" "{")))

;; 为 latex 提供折叠大纲功能
(use-package outline
  :hook
  (LaTeX-mode . outline-minor-mode)
)

(if IS-MAC
(use-package! dash-at-point
  :defer t
  :config
 (add-to-list 'dash-at-point-mode-alist '(python-mode . "python3,django,twisted,sphinx,flask,tornado,sqlalchemy,numpy,scipy,saltcvp,torch,torchvision"))
))

(use-package! just-mode
  :defer t)

(use-package! justl
  :defer t
  :config
  (map! :n "e" 'justl-exec-recipe))

(use-package! graphviz-dot-mode
  :mode "\\.\\(diag\\|dot\\|nwdiag\\|rackdiag\\)\\'"
  :init
  (after! org
    (add-to-list 'org-src-lang-modes
                  '("dot" . graphviz-dot)))
  :config
  (cl-defun +format-graphviz (&key buffer scratch callback &allow-other-keys)
    "Format graphviz graphs."
    (with-current-buffer scratch
      (let ((inhibit-message t)
            (message-log-max nil))
        (goto-char (point-min))
        (graphviz-dot-indent-graph))
      (funcall callback)))

  (when (and (not (treesit-available-p))
              (modulep! :lang graphviz +tree-sitter))
    (add-hook 'graphviz-dot-mode-hook #'tree-sitter! 'append))
  (after! tree-sitter
    (set-tree-sitter-lang! 'graphviz-dot-mode 'dot))
  (when (modulep! :completion company)
    (set-company-backend! 'graphviz-dot-mode 'company-graphviz-dot-backend))
  (setq graphviz-dot-view-command "kde-open5 %s") ;; doesn't work, need a proper viewer

  (enable-auto-formatter! 'graphviz-dot-mode)
  (set-formatter! 'graphviz-dot-mode #'+format-graphviz :modes '(graphviz-dot-mode))

  (map! :map graphviz-dot-mode-map
        :localleader
        :desc "External view" :nv "e" #'graphviz-dot-view
        :desc "Preview"       :nv "p" #'graphviz-dot-preview
        :prefix ("t" . "toggle")
        :desc "Preview"       :nv "p" (cmd! (if graphviz-dot-auto-preview-on-save
                                                (graphviz-turn-off-live-preview)
                                              (graphviz-turn-on-live-preview)))))

(use-package! org-noter
  :after org
  :defer t
  :config
  (setq org-noter-notes-search-path (concat org-directory "references"))
  (setq org-noter-alway-create-frame t)
  (setq org-noter-auto-save-last-location t)
  (setq org-noter-doc-split-fraction '(0.52 0.48))
)

;;(use-package! org-media-note
;;  :init (setq org-media-note-use-org-ref t)
;;  :hook (org-mode .  org-media-note-mode)
;;  :after org
;;  :bind (("H-v" . org-media-note-hydra/body))  ;; Main entrance
;;  :config
;;  (setq org-media-note-screenshot-image-dir "~/org/.attach/")  ;; Folder to save screenshot
;;  (setq org-media-note-use-refcite-first t)  ;; use videocite link instead of video link if possible
;;  )
