modules/editors/emacs/doom/config.org
** mpvi
:PROPERTIES:
:ID:       36d364ad-6e8d-4596-8fca-e4899d1311f3
:END:

#+begin_src emacs-lisp :tangle packages.el
;;(package! mpvi :recipe (:host github :repo "lorniu/mpvi"))
#+end_src

#+begin_src emacs-lisp :tangle config.el
;;(use-package! mpvi)
#+end_src
** anki
:PROPERTIES:
:ID:       abe7ac7e-f756-454e-bfe5-68b42efe8045
:END:
#+begin_src emacs-lisp :tangle packages.el
(package! org-anki :recipe (:host github :repo "eyeinsky/org-anki"))
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! org-anki
:defer t)
#+end_src
* APP
:PROPERTIES:
:ID:       c5312a82-9f24-4e4b-9f81-0660dbc3d380
:END:
#+begin_src emacs-lisp :tangle packages.el
(package! telega :built-in t)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! telega
  :commands (telega)
  :defer t
  ;;:config
  ;;(setq telega-server-libs-prefix)
)
#+end_src
* AI+X
** org ai
#+begin_src emacs-lisp :tangle packages.el
(package! org-ai)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! org-ai
  ;;:commands (org-ai-mode org-ai-global-mode)
  :hook (org-mode . org-ai-mode)
  :after org
  :defer t
  :init
  (org-ai-global-mode)
  :config
  ;;(setq org-ai-default-chat-model "gpt-4") ; if you are on the gpt-4 beta:
  (org-ai-install-yasnippets)
)
#+end_src

* Alter/Message
#+begin_src emacs-lisp :tangle packages.el
(package! alert)
#+end_src


#+begin_src emacs-lisp :tangle config.el
(use-package alert
  :defer t
  :config
  (if IS-MAC
      (setq alert-default-style 'osx-notifier)
    (setq alert-default-style 'libnotify))
)
#+end_src
* Git
#+begin_src emacs-lisp :tangle packages.el
;; 获得当前的repo commit的连接
(package! git-link)
;; magti file icons
(package! magit-file-icons)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package git-link :defer t)

(use-package magit-file-icons
  :ensure t
  :after magit
  :init
  (magit-file-icons-mode 1)
  :custom
  ;; These are the default values:
  (magit-file-icons-enable-diff-file-section-icons t)
  (magit-file-icons-enable-untracked-icons t)
  (magit-file-icons-enable-diffstat-icons t))
#+end_src

* Other module
** Time tracking
:PROPERTIES:
:ID:       ea697417-3b23-406f-b821-7fd01c60d7e5
:END:
#+begin_src emacs-lisp :tangle no
;; (package! wakatime-mode)
#+end_src

#+begin_src emacs-lisp :tangle no
;; (use-package! wakatime-mode
;; :defer t
;;   :config
;;   (setq wakatime-cli-path
;;     (cond (IS-MAC "/etc/profiles/per-user/klchen/bin/wakatime-cli")
;;           (IS-WINDOWS "~/.wakatime/wakatime-cli")))
;;   (global-wakatime-mode)
;; )
#+end_src
** openwith
#+begin_src emacs-lisp :tangle packages.el
(package! openwith)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! openwith
:defer t
  :hook (emacs-startup . openwith-mode)
  :init
  (setq +openwith-extensions '("pdf" "jpg" "png" "jpeg" "mp4"))
  :config
  (when-let (cmd (cond ((featurep :system 'macos) "open")
                       ((featurep :system 'linux) "xdg-open")
                       ((featurep :system 'windows) "start")))
    (setq openwith-associations
          (list (list (openwith-make-extension-regexp +openwith-extensions)
                      cmd '(file)))))
  (advice-add #'openwith-file-handler :around
              (lambda (fn &rest args)
                (let ((process-connection-type nil))
                  (apply fn args)))))
#+end_src



** Keyfreq
:PROPERTIES:
:ID:       82dfd063-35af-436e-8453-c1351c96e768
:END:

#+begin_src emacs-lisp :tangle no
(package! keyfreq)
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package! keyfreq
  :defer t
  :config
  (setq keyfreq-mode t
        keyfreq-autosave-mode t)
)
#+end_src
** activitywatch
#+begin_src emacs-lisp :tangle packages.el
;;(package! activity-watch-mode)
#+end_src

#+begin_src emacs-lisp :tangle config.el
;;(use-package! activity-watch-mode
;;:defer t
;;:init
;;(global-activity-watch-mode)
;;)
#+end_src

** Exec Path
#+begin_src emacs-lisp :tangle packages.el
(package! exec-path-from-shell)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! exec-path-from-shell)
#+end_src
