modules/editors/emacs/doom/config.el

;;(use-package! mpvi)

(use-package! org-anki
:defer t)

(use-package! telega
  :commands (telega)
  :defer t
  ;;:config
  ;;(setq telega-server-libs-prefix)
)

(use-package! alert
  :defer t
  :config
  (if IS-MAC
      (setq alert-default-style 'osx-notifier)
    (setq alert-default-style 'libnotify))
)

(use-package git-link :defer t)

(use-package magit-file-icons
  :ensure t
  :after magit
  :init
  (magit-file-icons-mode 1)
  :custom
  ;; These are the default values:
  (magit-file-icons-enable-diff-file-section-icons t)
  (magit-file-icons-enable-untracked-icons t)
  (magit-file-icons-enable-diffstat-icons t))

(use-package! openwith
:defer t
  :hook (emacs-startup . openwith-mode)
  :init
  (setq +openwith-extensions '("pdf" "jpg" "png" "jpeg" "mp4"))
  :config
  (when-let (cmd (cond ((featurep :system 'macos) "open")
                       ((featurep :system 'linux) "xdg-open")
                       ((featurep :system 'windows) "start")))
    (setq openwith-associations
          (list (list (openwith-make-extension-regexp +openwith-extensions)
                      cmd '(file)))))
  (advice-add #'openwith-file-handler :around
              (lambda (fn &rest args)
                (let ((process-connection-type nil))
                  (apply fn args)))))

;;(use-package! activity-watch-mode
;;:defer t
;;:init
;;(global-activity-watch-mode)
;;)

(use-package! exec-path-from-shell)
