modules/editors/emacs/doom/packages.el

;;(package! mpvi :recipe (:host github :repo "lorniu/mpvi"))

(package! org-anki :recipe (:host github :repo "eyeinsky/org-anki"))

(package! telega :built-in t)

(package! alert)

;; 获得当前的repo commit的连接
(package! git-link)
;; magti file icons
(package! magit-file-icons)

(package! openwith)

;;(package! activity-watch-mode)

(package! exec-path-from-shell)
